#include <locale.h>
#include <stdio.h>



int main(void)
{
	setlocale(LC_CTYPE, "rus");

	int N = 15;
	int K = 34;

	printf("Ñåé÷àñ %d ÷àñîâ, %d ìèíóò, 00 ñåêóíä\n", N, K);

	puts("-----------------------------------------------------------------");

	printf("Èäåò %d ìèíóòà ñóòîê\n", N*60+K);

	puts("-----------------------------------------------------------------");

	printf("Äî ïîëóíî÷è îñòàëîñü %d ÷àñîâ è %d ìèíóò\n", 23-N,60-K);

	puts("-----------------------------------------------------------------");

		if (N > 8)
		{
			printf("C 8:00 ïðîøëî %d ñåêóíä\n", (N - 8) * 3600 + K * 60);
		}
		else
		{
			printf("8:00 åùå íå íàñòóïèëî!\n");
		}

	puts("-----------------------------------------------------------------");

	printf("Òåêóùèé ÷àñ =  %d/24 è òåêóùàÿ ìèíóòà %d/60 ÷àñà\n", N, K);

	return 0;
}
