#include <locale.h>
#include <stdio.h>



int main(void)
{
	setlocale(LC_CTYPE, "rus");

	int N = 15;
	int K = 34;

	printf("Сейчас %d часов, %d минут, 00 секунд\n", N, K);

	puts("-----------------------------------------------------------------");

	printf("Идет %d минута суток\n", N*60+K);

	puts("-----------------------------------------------------------------");

	printf("До полуночи осталось %d часов и %d минут\n", 24-N,60-K);

	puts("-----------------------------------------------------------------");

		if (N > 8)
		{
			printf("C 8:00 прошло %d секунд\n", (N - 8) * 3600 + K * 60);
		}
		else
		{
			printf("8:00 еще не наступило!\n");
		}

	puts("-----------------------------------------------------------------");

	printf("Текущий час =  %d/24 и текущая минута %d/60 часа\n", N, K);

	return 0;
}
