#include <locale.h>
#include <stdio.h>

void name()
{
	
	setlocale(LC_CTYPE, "rus");

	puts("***********************************************************************************");
	puts("*                                                                                 *");
	puts("* тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
	puts("*                                                                                 *");
	puts("*    Выполнил: Крылатков Д.А.                                                     *");
	puts("*                                                                                 *");
	puts("***********************************************************************************");
}

void date()
{
	puts("  _   _  _   _ __");
	puts("/| | | |/_  | | /");
	puts(" |/_.|_||_|.|_|/");

}

void main()
{
	name();
	date();
	return 0;

}
