#include <locale.h>
#include <stdio.h>

void main()
{
	setlocale(LC_CTYPE, "rus");

	puts("***********************************************************************************");
	puts("*                                                                                 *");
	puts("* тема: Написание и компиляция консольного приложения в среде разработки MVS 2022 *");
	puts("*                                                                                 *");
	puts("*    Выполнил Крылатков Д.А.                                                      *");
	puts("*                                                                                 *");
	puts("***********************************************************************************");


	system("pause");
}
